Autodesk.Revit.DB.DividedSurface.CanBeIntersectionElement(Autodesk.Revit.DB.ElementId)
Checks if the element can be an intersection reference.
Remarks:
The element must be a level, grid, reference plane,
or a curve element whose category is lines and reference lines.
id:
The element to be checked.
Returns:
True if the element can be an intersection reference., false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.DividedSurface.RemoveIntersectionElement(Autodesk.Revit.DB.ElementId)
Removes an intersection element from a divided surface.
referenceElemIdToRemove:
The intersection element to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.DividedSurface.AddIntersectionElement(Autodesk.Revit.DB.ElementId)
Adds an intersection element to the divided surface.
newIntersectionElemId:
The intersection element to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element newIntersectionElemId is not a level, grid, reference plane,
or a curve element whose category is lines and reference lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.DividedSurface.GetDividedSurfaceForReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Get a divided surface for a given reference.  Returns null if the reference does not host a divided surface.
document:
The document.
faceReference:
Reference that represents a face.
Returns:
The newly created divided surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DividedSurface.GetReferencesWithDividedSurfaces(Autodesk.Revit.DB.Element)
For a given host element get references to all the faces that host a divided surface
host:
The element that hosts the divided surfaces
Returns:
References that host a divided surface
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DividedSurface.CanBeDivided(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
This returns true if the reference represents a face that can be used to create a divided surface.
document:
The document.
reference:
The reference.
Returns:
True if the reference can be used to create a divided surface, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DividedSurface.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Creates a new instance of a divided surface with a default layout.
document:
The document.
faceReference:
Reference that represents a face.
Returns:
The newly created divided surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a divided surface.
-or-
Reference is unstable import element
-or-
Reference does not represent a face
-or-
Reference already hosts a divided surface
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014